ka2_2024/src/Enums/ВидыЛьготПоИмущественнымНалогам/ВидыЛьготПоИмущественнымНалогам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыЛьготПоИмущественнымНалогам</name>
  <enumValues>
    <name>Освобождение</name>
  </enumValues>
  <enumValues>
    <name>СнижениеСтавкиНаПроцент</name>
  </enumValues>
  <enumValues>
    <name>СнижениеСтавкиДоУказанной</name>
  </enumValues>
  <enumValues>
    <name>СнижениеСуммыНаПроцент</name>
  </enumValues>
  <enumValues>
    <name>СнижениеСуммыНаСумму</name>
  </enumValues>
  <enumValues>
    <name>СнижениеНалоговойБазыНаСумму</name>
  </enumValues>
  <enumValues>
    <name>ДоляНеоблагаемойПлощади</name>
  </enumValues>
</mdclass:Enum>

ka2_2024/src/Catalogs/ОснованияЛьготПоИмущественнымНалогам/ОснованияЛьготПоИмущественнымНалогам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ОснованияЛьготПоИмущественнымНалогам</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Налог</name>
    <type>
      <types>EnumRef.ВидыИмущественныхНалогов</types>
    </type>
  </attributes>
  <attributes>
    <name>УстановленаМестнымНормативнымАктом</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КодЛьготы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>7</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидЛьготы</name>
    <type>
      <types>EnumRef.ВидыЛьготПоИмущественнымНалогам</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНормативногоАкта</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерНормативногоАкта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОснованиеМестнойЛьготы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>24</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентУменьшения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодРегиона</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПоОКТМО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>8</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МуниципальноеОбразование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГдеУстановлена</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

ka2_2024/src/CommonModules/ЛьготыПоИмущественнымНалогам/Module.bsl
#Область ПрограммныйИнтерфейс

// Формирует дополнительное описание для льготы с учетом ее применения к конкретной организации и/или
// к конкретному объекту налогообложения 
// 
// Параметры:
//  Льгота - СправочникСсылка.ОснованияЛьготПоИмущественнымНалогам - льгота, для которой формируется текст подсказки
//  Организация - СправочникСсылка.Организации - организация, в отношении имущества которой применена льгота
//  Период - дата - дата, на которую выбираются данные о льготе
//  ОсновноеСредство - СправочникСсылка.ОсновныеСредства - объект налогообложения, в отношении которого применена льгота.
//  	Если не указан, то текст подсказки формируется с учетом применения льготы в целом по организации.
// 
// Возвращаемое значение:
//  ФорматированнаяСтрока - текст подсказки для льготы
//
Функция ТекстПодсказкиЛьготы(Льгота, Организация, Период, ОсновноеСредство = Неопределено) Экспорт 

	Подсказка = Новый Массив;
	ЕстьОшибки = Ложь;
	
	ЦветТекста = ?(ЕстьОшибки, ЦветаСтиля.НезаполненныйРеквизит, ЦветаСтиля.ЦветГиперссылки);
	Возврат Новый ФорматированнаяСтрока(Подсказка,, ЦветТекста,, "ПодтверждающиеДокументы");
	
КонецФункции

// Формирует наименование для федеральной льготы (поименованной в НК).
// 
// Параметры:
//  Объект - СправочникОбъект.ОснованияЛьготПоИмущественнымНалогам - объект справочника льгот,
//		для которого нужно сформировать наименование. 
// 
// Возвращаемое значение:
//  Строка - наименование федеральной льготы
//
Функция НаименованиеФедеральнойЛьготы(Объект) Экспорт
		
	Наименование = Новый Массив;
	
	Если Объект.ВидЛьготы = Перечисления.ВидыЛьготПоИмущественнымНалогам.Освобождение Тогда
		Наименование.Добавить(Нстр("ru='Освобождение:'"));
	ИначеЕсли Объект.ВидЛьготы = Перечисления.ВидыЛьготПоИмущественнымНалогам.СнижениеСтавкиНаПроцент
		 И ЗначениеЗаполнено(Объект.ПроцентУменьшения) Тогда
		Наименование.Добавить(СтрШаблон(Нстр("ru='Снижение ставки на %1%%:'"), Объект.ПроцентУменьшения));
	ИначеЕсли Объект.ВидЛьготы = Перечисления.ВидыЛьготПоИмущественнымНалогам.СнижениеСтавкиНаПроцент
		 Или Объект.ВидЛьготы = Перечисления.ВидыЛьготПоИмущественнымНалогам.СнижениеСтавкиДоУказанной Тогда
		Наименование.Добавить(Нстр("ru='Снижение ставки:'"));
	ИначеЕсли Объект.ВидЛьготы = Перечисления.ВидыЛьготПоИмущественнымНалогам.СнижениеСуммыНаПроцент
		 И ЗначениеЗаполнено(Объект.ПроцентУменьшения) Тогда
		Наименование.Добавить(СтрШаблон(Нстр("ru='Снижение суммы налога на %1%%:'"), Объект.ПроцентУменьшения));
	ИначеЕсли Объект.ВидЛьготы = Перечисления.ВидыЛьготПоИмущественнымНалогам.СнижениеСуммыНаПроцент
		 Или Объект.ВидЛьготы = Перечисления.ВидыЛьготПоИмущественнымНалогам.СнижениеСуммыНаСумму Тогда
		Наименование.Добавить(Нстр("ru='Снижение суммы налога:'"));
	ИначеЕсли Объект.ВидЛьготы = Перечисления.ВидыЛьготПоИмущественнымНалогам.СнижениеНалоговойБазыНаСумму Тогда
		Наименование.Добавить(Нстр("ru='Снижение налоговой базы:'"));
	ИначеЕсли Объект.ВидЛьготы = Перечисления.ВидыЛьготПоИмущественнымНалогам.ДоляНеоблагаемойПлощади Тогда
		Наименование.Добавить(Нстр("ru='Доля необлагаемой площади:'"));
	КонецЕсли;
	
	ОписаниеЛьгот = ЛьготыПоИмущественнымНалогамПовтИсп.ДанныеОЛьготахПоИмущественнымНалогам(Объект.Налог);
	ОписаниеЛьготы = ОписаниеЛьгот.ФедеральныеЛьготы[Объект.КодЛьготы];
	Если ОписаниеЛьготы = Неопределено Тогда
		ТекстНаименования = СтрСоединить(Наименование);
		Возврат СтрЗаменить(ТекстНаименования, ":", "");
	Иначе
		Наименование.Добавить(ОписаниеЛьготы.Категория);
	КонецЕсли;
	
	Возврат СтрСоединить(Наименование, " ");
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция НайтиИлиСоздатьЛьготу(Налог, ПоискЛьготы, Льготы) Экспорт
	
	СозданныеЛьготы = Льготы.НайтиСтроки(ПоискЛьготы);
	Если СозданныеЛьготы.Количество() > 0 Тогда
		ОснованиеЛьготы = СозданныеЛьготы[0].ОснованиеЛьготы;
	ИначеЕсли ПоискЛьготы.Свойство("УстановленаМестнымНормативнымАктом") И ПоискЛьготы.УстановленаМестнымНормативнымАктом Тогда
		ОснованиеЛьготы = Справочники.ОснованияЛьготПоИмущественнымНалогам.МестнаяЛьготаПоПараметрам(
			Налог,
			ПоискЛьготы);
	Иначе
		ОснованиеЛьготы = Справочники.ОснованияЛьготПоИмущественнымНалогам.ФедеральнаяЛьготаПоКоду(
			Налог,
			ПоискЛьготы.КодЛьготы);
	КонецЕсли;	
	
	Если Не ЗначениеЗаполнено(ОснованиеЛьготы) Тогда
		ОснованиеЛьготыОбъект = Справочники.ОснованияЛьготПоИмущественнымНалогам.СоздатьЭлемент();
		ОснованиеЛьготыОбъект.Налог = Налог;
		ОснованиеЛьготыОбъект.Заполнить(ПоискЛьготы);
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ОснованиеЛьготыОбъект);
		ОснованиеЛьготы = ОснованиеЛьготыОбъект.Ссылка;
	КонецЕсли;
	
	СтрокаКэша = Льготы.Добавить();
	ЗаполнитьЗначенияСвойств(СтрокаКэша, ПоискЛьготы);
	СтрокаКэша.ОснованиеЛьготы = ОснованиеЛьготы;
	
	Возврат ОснованиеЛьготы;
	
КонецФункции

Функция ПоискМестнойЛьготы(КодРегиона, КодПоОКТМО) Экспорт

	ПоискЛьготы = Новый Структура;

	ПоискЛьготы.Вставить("КодРегиона", КодРегиона);
	ПоискЛьготы.Вставить("КодПоОКТМО", КодПоОКТМО);
	ПоискЛьготы.Вставить("УстановленаМестнымНормативнымАктом", Истина);
	
	Возврат ПоискЛьготы;
	
КонецФункции

#КонецОбласти
